In [1]:
import pandas as pd
import numpy as np

In [3]:
from pathlib import Path
data_path = Path('../datos')

In [8]:
dataset = pd.read_csv(data_path / 'data2.csv', sep=',')
dataset.head()

   Id_producto         Nombre  Categoria  Stock  Ventas
0            1  jabón naranja    jabones      7       3
1            2    jabón limón    jabones      4       6
2            3    jabón avena    jabones      5       5
3            4   jabón canela    jabones      8       2
4            5       amatista  minerales      3       2

In [9]:
r = dataset.sample(frac=0.1) #selección o porcentaje aleatorio del dataframe
r.shape #filas y columnas de un dataframe

(2, 5)

In [10]:
dataset.shape

(22, 5)

In [11]:
r.head()

    Id_producto             Nombre      Categoria  Stock  Ventas
16           17  árbol de amatista  ornamentación     25       5
15           16   árbol decorativo  ornamentación      2       4

In [17]:
dataset[dataset['Stock'].isin([4,8])]

   Id_producto        Nombre Categoria  Stock  Ventas
1            2   jabón limón   jabones      4       6
3            4  jabón canela   jabones      8       2

In [21]:
dataset['Stock'].where(dataset['Stock']==8, other='-')

0     -
1     -
2     -
3     8
4     -
5     -
6     -
7     -
8     -
9     -
10    -
11    -
12    -
13    -
14    -
15    -
16    -
17    -
18    -
19    -
20    -
21    -
Name: Stock, dtype: object

In [22]:
dataset.query('Stock == 7')

   Id_producto         Nombre Categoria  Stock  Ventas
0            1  jabón naranja   jabones      7       3

In [24]:
dataset.query('Stock == 7 or Ventas == 6 or Nombre == "amatista"')

   Id_producto              Nombre  Categoria  Stock  Ventas
0            1       jabón naranja    jabones      7       3
1            2         jabón limón    jabones      4       6
4            5            amatista  minerales      3       2
9           10  collar de amatista  bisutería      6       6

In [25]:
dataset.query('index < 6')

   Id_producto         Nombre  Categoria  Stock  Ventas
0            1  jabón naranja    jabones      7       3
1            2    jabón limón    jabones      4       6
2            3    jabón avena    jabones      5       5
3            4   jabón canela    jabones      8       2
4            5       amatista  minerales      3       2
5            6   ojo de tigre  minerales      5       2

In [26]:
dataset.query('Stock in (3,8)')

    Id_producto              Nombre   Categoria  Stock  Ventas
3             4        jabón canela     jabones      8       2
4             5            amatista   minerales      3       2
6             7             citrino   minerales      3       5
18           19  incienso de romero  sahumerios      3       4

In [29]:
categoria = 'sahumerios'
dataset.query(f'Categoria == "{categoria}"')

    Id_producto               Nombre   Categoria  Stock  Ventas
18           19   incienso de romero  sahumerios      3       4
19           20  incienso de lavanda  sahumerios      9       7
20           21   incienso de canela  sahumerios      1       7
21           22     incienso de ruda  sahumerios      6       4

In [31]:
dataset.drop_duplicates('Categoria', inplace=False, keep = 'first') #elimina duplicados, inplace false no modifica el original y keep cual se mantiene

    Id_producto               Nombre      Categoria  Stock  Ventas
0             1        jabón naranja        jabones      7       3
4             5             amatista      minerales      3       2
7             8  péndulo de amatista   herramientas     13       5
9            10   collar de amatista      bisutería      6       6
15           16     árbol decorativo  ornamentación      2       4
18           19   incienso de romero     sahumerios      3       4